{
  "classes": [
    {
      "id": "bjj-podstawy",
      "level": "podstawy",
      "durationMin": 60,
      "gear": ["Sports shirt", "Shorts without pockets"],
      "icons": {"type":"Sparkles","duration":"Clock","gear":"Shirt"},
      "copy": {
        "en": {
          "name": "Jiu-Jitsu Fundamentals",
          "teaser": "Want to start your jiu-jitsu journey? This is the perfect class for you!",
          "description": "Ground fighting fundamentals: basic positions, control, and submissions. Join anytime – no experience required.",
          "forWhom": [
            "Complete beginners who want to learn jiu-jitsu from scratch",
            "More experienced practitioners who want to strengthen their fundamentals and perfect their basics"
          ],
          "gearNote": ""
        }
      }
    },
    {
      "id": "zapasy-bjj",
      "level": "mieszane",
      "durationMin": 75,
      "gear": ["Sports shirt", "Shorts without pockets"],
      "icons": {"type":"Footprints","duration":"Clock","gear":"Shirt"},
      "copy": {
        "en": {
          "name": "Wrestling/Jiu-Jitsu",
          "teaser": "Want to become a complete grappler? This is a training you can't miss!",
          "description": "Wrestling and judo takedowns + ground fighting. First half: throws from basics. Second half: advanced ground concepts.",
          "forWhom": [
            "Anyone who wants to learn wrestling skills and their application in jiu-jitsu context",
            "Both beginners and advanced practitioners – training adapted for all skill levels"
          ],
          "gearNote": ""
        }
      }
    },
    {
      "id": "bjj-zaawansowani",
      "level": "zaawansowani",
      "durationMin": 75,
      "gear": ["Sports shirt", "Shorts without pockets"],
      "icons": {"type":"Brain","duration":"Clock","gear":"Shirt"},
      "copy": {
        "en": {
          "name": "Jiu-Jitsu Advanced",
          "teaser": "Higher intensity training focusing on more advanced aspects of ground fighting.",
          "description": "High-intensity training: advanced techniques, strategy, competition preparation.",
          "forWhom": [
            "Experienced practitioners with solid jiu-jitsu foundation who want to refine their skills",
            "Athletes preparing for competitions and tournaments"
          ],
          "gearNote": ""
        }
      }
    },
    {
      "id": "mma-podstawy",
      "level": "podstawy",
      "durationMin": 60,
      "gear": ["Sports shirt", "Shorts without pockets", "Mouthguard", "8oz gloves", "Shin guards"],
      "icons": {"type":"Dumbbell","duration":"Clock","gear":"Package"},
      "copy": {
        "en": {
          "name": "MMA Fundamentals",
          "teaser": "Have no MMA experience and want to start training? This is the perfect group for your first session!",
          "description": "MMA fundamentals: striking, wrestling, ground fighting. Well-rounded introduction to all combat ranges. Join anytime.",
          "forWhom": [
            "Complete beginners who want to learn the basics of mixed martial arts",
            "More experienced athletes from other disciplines who want to develop well-rounded MMA skills"
          ],
          "gearNote": "You don't need any equipment for your first sessions - we'll lend it to you on site :)"
        }
      }
    },
    {
      "id": "kickboxing-podstawy",
      "level": "podstawy",
      "durationMin": 60,
      "gear": ["Sports shirt", "Shorts without pockets", "Mouthguard", "10oz+ gloves", "Shin guards"],
      "icons": {"type":"Zap","duration":"Clock","gear":"Package"},
      "copy": {
        "en": {
          "name": "Kickboxing Fundamentals",
          "teaser": "Have no kickboxing experience but would like to start training? This is the perfect group for your first session!",
          "description": "Fundamental kickboxing: stance, footwork, punches, kicks, and defense. Technique over power. Join anytime.",
          "forWhom": [
            "Complete beginners who want to learn kickboxing from the ground up",
            "More experienced practitioners who want to refine their fundamental techniques and improve their striking basics"
          ],
          "gearNote": "You don't need any equipment for your first sessions - we'll lend it to you on site :)"
        }
      }
    },
    {
      "id": "bjj-wszystkie",
      "level": "wszystkie",
      "durationMin": 90,
      "gear": ["Sports shirt", "Shorts without pockets"],
      "icons": {"type":"Users","duration":"Clock","gear":"Shirt"},
      "copy": {
        "en": {
          "name": "Jiu-Jitsu All Levels",
          "teaser": "A training where we mix learning jiu-jitsu fundamentals with advanced topics and wrestling elements.",
          "description": "Mix of fundamentals and advanced techniques + wrestling elements. Beginners and experienced practitioners train together.",
          "forWhom": [
            "Perfect for all skill levels – beginners learn from experienced partners while advanced practitioners refine their teaching and fundamentals"
          ],
          "gearNote": ""
        }
      }
    },
    {
      "id": "wolna-mata",
      "level": "mieszane",
      "durationMin": 120,
      "gear": [],
      "icons": {"type":"CalendarClock","duration":"Clock","gear":"Shirt"},
      "copy": {
        "en": {
          "name": "Open Mat",
          "teaser": "The training is not structured - you can come at any time, find a training partner, work on technique, do sparring - you have complete freedom in these sessions.",
          "description": "Self-directed training: drill techniques, sparring, conditioning. Coach always present for guidance and safety.",
          "forWhom": [
            "Suitable for all levels – from beginners wanting extra practice time to advanced athletes preparing for competition"
          ],
          "gearNote": ""
        }
      }
    },
    {
      "id": "gry-i-zabawy-3-5",
      "level": "dzieci",
      "durationMin": 40,
      "gear": ["Sports shirt", "Shorts without pockets"],
      "icons": {"type":"Baby","duration":"Clock","gear":"Shirt"},
      "copy": {
        "en": {
          "name": "Games and Play with Martial Arts Elements",
          "teaser": "Classes created especially for our youngest warriors.",
          "description": "40 minutes of fun developing coordination, balance, and confidence. Safe games with basic martial arts elements.",
          "forWhom": [
            "Children aged 3–5 years who are ready for their first martial arts experience",
            "Perfect as an introduction to structured physical activity and martial arts"
          ],
          "gearNote": ""
        }
      }
    },
    {
      "id": "bjj-dzieci-6-12",
      "level": "dzieci",
      "durationMin": 55,
      "gear": ["Sports shirt", "Shorts without pockets"],
      "icons": {"type":"Baby","duration":"Clock","gear":"Shirt"},
      "copy": {
        "en": {
          "name": "Jiu-Jitsu for Kids",
          "teaser": "Training designed for young warriors who want to learn discipline, respect, and confidence.",
          "description": "Age-appropriate Jiu-Jitsu techniques, partner cooperation, discipline and respect. Safe and supportive environment.",
          "forWhom": [
            "Children aged 6–12 years who are ready to learn structured martial arts techniques and discipline"
          ],
          "gearNote": ""
        }
      }
    }
  ]
}